app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page],per_page:6)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "vipcafe"], ["email", "vipcafe@gmail.com"], ["updated_at", "2021-02-04 08:38:12.763411"], ["id", 1]]

  def destroy
    User.find_by(id: params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def correct_user
  @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 103], ["LIMIT", 1]]